ZEO/NHibernate/HotfixBranchCode/Zeo/CXN.Xfr/Nexxo.Cxn.MoneyTransfer.WU/Service References/SendMoneyRefund/Refund_Service_H2HService.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://www.westernunion.com/RefundService_H2H" xmlns:xrsi="http://www.westernunion.com/schema/xrsi" name="Refund_Service_H2HService" targetNamespace="http://www.westernunion.com/RefundService_H2H" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xsd:schema xmlns:mrm="http://www.westernunion.com/RefundService_H2H" targetNamespace="http://www.westernunion.com/RefundService_H2H">
      <xsd:import schemaLocation="../schema/XRSIErrorReply.xsd" namespace="http://www.westernunion.com/schema/xrsi" />
      <xsd:import schemaLocation="../schema/XRSIRefundReply.xsd" namespace="http://www.westernunion.com/schema/xrsi" />
      <xsd:import schemaLocation="../schema/XRSIRefundRequest.xsd" namespace="http://www.westernunion.com/schema/xrsi" />
    </xsd:schema>
  </wsdl:types>
  <wsdl:message name="Refund_in">
    <wsdl:part name="refund-request" element="xrsi:refund-request" />
  </wsdl:message>
  <wsdl:message name="Refund_out">
    <wsdl:part name="refund-reply" element="xrsi:refund-reply" />
  </wsdl:message>
  <wsdl:message name="Refund_fault1">
    <wsdl:part name="error-reply" element="xrsi:error-reply" />
  </wsdl:message>
  <wsdl:portType name="RefundPortType">
    <wsdl:operation name="Refund">
      <wsdl:input name="Refund_Input" message="tns:Refund_in" />
      <wsdl:output name="Refund_Output" message="tns:Refund_out" />
      <wsdl:fault name="Refund_Fault" message="tns:Refund_fault1" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="Refund_H2H_SOAP_HTTP_Binding" type="tns:RefundPortType">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="Refund">
      <soap:operation soapAction="" />
      <wsdl:input name="Refund_Input">
        <soap:body use="literal" parts="refund-request" />
      </wsdl:input>
      <wsdl:output name="Refund_Output">
        <soap:body use="literal" parts="refund-reply" />
      </wsdl:output>
      <wsdl:fault name="Refund_Fault">
        <soap:fault use="literal" name="Refund_Fault" namespace="" />
      </wsdl:fault>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="Refund_Service_H2H">
    <wsdl:port name="SOAP_HTTP_Port" binding="tns:Refund_H2H_SOAP_HTTP_Binding">
      <soap:address location="http://www.westernunion.com/Refund_Service_H2H" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>