xmlsamples/PI_MTCN/CN393-REFUND-CONFIRM-AIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:refund-request>
         <device>
            <type>AGENT</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>ESP</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>JING</first_name>
               <last_name>BEI</last_name>
            </name>
            <address>
               <addr_line1>beijingtongzhou</addr_line1>
               <city>Beijing</city>
               <state>Beijing</state>
               <postal_code>123123</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>CN</country_code>
                     <currency_code>CNY</currency_code>
                  </iso_code>
               </country_code>
               <state_zip>123123</state_zip>
               <street>beijingtongzhou</street>
            </address>
            <contact_phone>15502331011</contact_phone>
            <mobile_phone>
               <phone_number/>
            </mobile_phone>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>ZHAN</first_name>
               <last_name>HU</last_name>
            </name>
            <address>
               <city>sdfdsfsdf</city>
               <state>AK</state>
               <country_code>
                  <iso_code>
                     <country_code>US</country_code>
                     <currency_code>USD</currency_code>
                  </iso_code>
               </country_code>
               <state_zip>123456</state_zip>
            </address>
            <contact_phone>186456123</contact_phone>
            <mobile_phone>
               <phone_number/>
            </mobile_phone>
         </receiver>
         <payment_details>
            <expected_payout_location>
               <state_code>AK</state_code>
               <city>sdfdsfsdf</city>
            </expected_payout_location>
            <destination_country_currency>
               <iso_code>
                  <country_code>US</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>CN</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </originating_country_currency>
            <originating_city>BEIJINGCD1</originating_city>
            <transaction_type>WMN</transaction_type>
            <exchange_rate>1.0000000</exchange_rate>
            <original_destination_country_currency>
               <iso_code>
                  <country_code>US</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </original_destination_country_currency>
         </payment_details>
         <financials>
            <originators_principal_amount>10000</originators_principal_amount>
            <destination_principal_amount>10000</destination_principal_amount>
            <gross_total_amount>11700</gross_total_amount>
            <pay_amount>10000</pay_amount>
            <principal_amount>10000</principal_amount>
            <charges>1700</charges>
            <tolls>0</tolls>
         </financials>
         <mtcn>9279224912</mtcn>
         <new_mtcn>2118289279224912</new_mtcn>
         <encompass_reason_code>CCM</encompass_reason_code>
         <comments>THIS IS A REFUND OF PRINCIPAL AMOUNT ONLY</comments>
         <money_transfer_key>3623906179</money_transfer_key>
         <foreign_remote_system>
            <identifier>WGHHCN3930T</identifier>
            <reference_no>29997000123833851</reference_no>
            <counter_id>CN393EWT001A</counter_id>
         </foreign_remote_system>
      </xrsi:refund-request>
   </soapenv:Body>
</soapenv:Envelope>