xmlsamples/PI_MTCN/TW701-REFUND-CONFIRM-AIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:refund-request>
         <device>
            <id>GJZFQZ0X</id>
            <type>AGENT</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>KTB</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>LARRY</first_name>
               <last_name>THERON</last_name>
            </name>
            <address>
               <addr_line1>LOCATION 1</addr_line1>
               <city>ATHENS</city>
               <postal_code>00000</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>GR</country_code>
                     <currency_code>EUR</currency_code>
                  </iso_code>
               </country_code>
               <state_zip>00000</state_zip>
               <street>LOCATION 1</street>
            </address>
            <contact_phone>6987744587</contact_phone>
            <mobile_phone>
               <phone_number/>
            </mobile_phone>
            <mobile_details/>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>WHITLEY</first_name>
               <last_name>SOLOMON</last_name>
            </name>
            <address>
               <country_code>
                  <iso_code>
                     <country_code>GR</country_code>
                     <currency_code>EUR</currency_code>
                  </iso_code>
               </country_code>
            </address>
            <mobile_phone>
               <phone_number/>
            </mobile_phone>
            <mobile_details/>
         </receiver>
         <payment_details>
            <expected_payout_location>
               <state_code>FL</state_code>
               <city/>
            </expected_payout_location>
            <destination_country_currency>
               <iso_code>
                  <country_code>CN</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>TW</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </originating_country_currency>
            <originating_city>TAINANET1</originating_city>
            <transaction_type>WMF</transaction_type>
            <exchange_rate>1.0000000</exchange_rate>
            <original_destination_country_currency>
               <iso_code>
                  <country_code>CN</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </original_destination_country_currency>
         </payment_details>
         <financials>
            <originators_principal_amount>2700</originators_principal_amount>
            <destination_principal_amount>2700</destination_principal_amount>
            <gross_total_amount>3700</gross_total_amount>
            <pay_amount>2700</pay_amount>
            <principal_amount>2700</principal_amount>
            <charges>800</charges>
            <tolls>200</tolls>
         </financials>
         <mtcn>1219142569</mtcn>
         <new_mtcn>2116981219142569</new_mtcn>
         <encompass_reason_code>CCM</encompass_reason_code>
         <comments>THIS IS A REFUND OF PRINCIPAL AMOUNT ONLY</comments>
         <money_transfer_key>3623959607</money_transfer_key>
         <foreign_remote_system>
            <identifier>WGHHTW7010T</identifier>
            <reference_no>001CL03223174744</reference_no>
            <counter_id>TW701PP0001A</counter_id>
         </foreign_remote_system>
      </xrsi:refund-request>
   </soapenv:Body>
</soapenv:Envelope>