xmlsamples/PI_MTCN/CNH60-REFUND-CONFIRM-AIS.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xrsi="http://www.westernunion.com/schema/xrsi">
   <soapenv:Header/>
   <soapenv:Body>
      <xrsi:refund-request>
         <device>
            <type>AGENT</type>
         </device>
         <channel>
            <type>H2H</type>
            <name>ESP</name>
            <version>9500</version>
         </channel>
         <sender>
            <name name_type="D">
               <first_name>XIN</first_name>
               <last_name>KAI</last_name>
            </name>
            <address>
               <addr_line1>SDFSD</addr_line1>
               <city>SDFS</city>
               <state>SDFSDF</state>
               <postal_code>123432</postal_code>
               <country_code>
                  <iso_code>
                     <country_code>CN</country_code>
                     <currency_code>CNY</currency_code>
                  </iso_code>
               </country_code>
               <state_zip>123432</state_zip>
               <street>SDFSD</street>
            </address>
            <contact_phone>13022554789</contact_phone>
            <mobile_phone>
               <phone_number/>
            </mobile_phone>
         </sender>
         <receiver>
            <name name_type="D">
               <first_name>GHDFGH</first_name>
               <last_name>JHH</last_name>
            </name>
            <address>
               <country_code>
                  <iso_code>
                     <country_code>KR</country_code>
                     <currency_code>USD</currency_code>
                  </iso_code>
               </country_code>
            </address>
            <mobile_phone>
               <phone_number/>
            </mobile_phone>
         </receiver>
         <payment_details>
            <expected_payout_location>
               <state_code>Albay</state_code>
            </expected_payout_location>
            <destination_country_currency>
               <iso_code>
                  <country_code>CN</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </destination_country_currency>
            <originating_country_currency>
               <iso_code>
                  <country_code>CN</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </originating_country_currency>
            <originating_city>SHANGHAI002</originating_city>
            <transaction_type>WMN</transaction_type>
            <exchange_rate>1.0000000</exchange_rate>
            <original_destination_country_currency>
               <iso_code>
                  <country_code>KR</country_code>
                  <currency_code>USD</currency_code>
               </iso_code>
            </original_destination_country_currency>
         </payment_details>
         <financials>
            <originators_principal_amount>4400</originators_principal_amount>
            <destination_principal_amount>4400</destination_principal_amount>
            <gross_total_amount>6100</gross_total_amount>
            <pay_amount>4400</pay_amount>
            <principal_amount>4400</principal_amount>
            <charges>1700</charges>
            <tolls>0</tolls>
         </financials>
         <mtcn>5039303370</mtcn>
         <new_mtcn>2118185039303370</new_mtcn>
         <encompass_reason_code>CCM</encompass_reason_code>
         <comments>THIS IS A REFUND OF PRINCIPAL AMOUNT ONLY</comments>
         <money_transfer_key>3623923783</money_transfer_key>
         <foreign_remote_system>
            <identifier>WGHHCNH600T</identifier>
            <reference_no>2021102000103823</reference_no>
            <counter_id>CNH60PT0001A</counter_id>
         </foreign_remote_system>
      </xrsi:refund-request>
   </soapenv:Body>
</soapenv:Envelope>